app/views/newscasts/_newscast.html.erb

SELECT COUNT(*) FROM "comments"  WHERE "comments"."newscast_id" = $1  [["newscast_id", 2]]
---
          <td>
            <%= n.comments.size %>