app/views/time_tables/_allTime.html.erb

SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."class_timing_id" = 5 AND "time_table_entries"."weekday_id" = 1 AND "time_table_entries"."time_table_id" = 1 LIMIT 1
---
        <% @class_timing.each do |c|%>
        <% @present=TimeTableEntry.find_by_class_timing_id_and_weekday_id_and_time_table_id(c.id,w.id,@time1) %>

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
         <font color="red"><%= @present.subject.name %></font><br/>
       <font color="blue"><%= @present.employee.first_name+" "+@present.employee.last_name%></font><br/>