app/views/time_tables/_institutional_time_table.html.erb

<%@time_table.each do |t| %>
 <%@time_table_entries=TimeTableEntry.where(time_table_id:t.id)%>
 <%@time_table_entries.each do |time|%>
   <% @timing = ClassTiming.find(time.class_timing_id) %>
     <% @present=TimeTableEntry.find_by_class_timing_id_and_weekday_id_and_time_table_id(time.class_timing_id,time.weekday_id,time.time_table) %>
---
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."time_table_id" = 1
SELECT  "class_timings".* FROM "class_timings"  WHERE "class_timings"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."class_timing_id" = 5 AND "time_table_entries"."weekday_id" = 5 AND "time_table_entries"."time_table_id" = 1 LIMIT 1

      <%=@present.subject.name%><br/>
      <%=@present.employee.first_name%>
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]