app/views/time_tables/_teacher_time_table_display.html.erb

         <% @weekdays.each do |weekday| %>
            <th colspan="<%=@class_timings.count %>"><%= weekday.weekday%></th>
---
SELECT  "weekdays".* FROM "weekdays"  WHERE "weekdays"."id" = $1 LIMIT 1  [["id", 5]]

              <td>
            <%t=TimeTableEntry.find_by_employee_id_and_class_timing_id_and_weekday_id_and_time_table_id(employee.id,c.id,weekday.id,@time_table)%>
---
SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."employee_id" = 1 AND "time_table_entries"."class_timing_id" = 5 AND "time_table_entries"."weekday_id" = 5 AND "time_table_entries"."time_table_id" = 1 LIMIT 1