app/views/time_tables/_view.html.erb


      <%=f.select :id, @batches.uniq.collect{|b| [b.course.course_name+" "+b.course.section_name+" - "+b.name, b.id]},{prompt:true},{onchange:"$('#batch_form').submit();",class: "form-control",style:"width:250px"} %>
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]