app/views/time_tables/work_allotment.html.erb

              <td><b><%=subj.name%>:</b></td>
        <td><%=select_tag "employee_subjects[#{subj.id}]",options_for_select([[t('select_employee'),""]]+Employee.all.collect{|c| [c.first_name,c.id]},subj.employees.first.try(:id)),class: "form-control",style:"width:350px"%>
---
SELECT  "employees".* FROM "employees" INNER JOIN "employee_subjects" ON "employees"."id" = "employee_subjects"."employee_id" WHERE "employee_subjects"."subject_id" = $1  ORDER BY "employees"."id" ASC LIMIT 1  [["subject_id", 6]]