app/views/employees/_assign_emp_list.html.erb

	<%@assigned_employees.each do |emp|%>
	<% @employee = Employee.find(emp.employee_id) %>
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]