app/views/employees/_display_payslip.html.erb

SELECT "monthly_payslips"."is_approved" FROM "monthly_payslips"  WHERE "monthly_payslips"."employee_id" = 1
---
          <%approved_tot=0%>
          <%approved=MonthlyPayslip.where(is_approved:'true').pluck(:amount)

SELECT "monthly_payslips"."amount" FROM "monthly_payslips"  WHERE "monthly_payslips"."employee_id" = 1
---

               <%amount=MonthlyPayslip.where(employee_id:emp.id).pluck(:amount)%>

SELECT "monthly_payslips"."salary_date" FROM "monthly_payslips"  WHERE "monthly_payslips"."employee_id" = 1
---

               <%salary_date=MonthlyPayslip.where(employee_id:1).pluck(:salary_date)%>