app/views/employees/_emp_list.html.erb

SELECT  "employee_subjects".* FROM "employee_subjects"  WHERE "employee_subjects"."employee_id" = 1 AND "employee_subjects"."subject_id" = 4 LIMIT 1
---
	<%@employees.each do |emp|%>
	<%is_assigned=EmployeeSubject.find_by_employee_id_and_subject_id(emp.id,@subject.id)%>