app/views/employees/_monthly_payslip_form.html.erb

SELECT  "employee_salery_structures".* FROM "employee_salery_structures"  WHERE "employee_salery_structures"."employee_id" = 9 AND "employee_salery_structures"."payroll_category_id" = 16 LIMIT 1
---
      <%@independent_categories.each do |c| %>
      <% val = EmployeeSaleryStructure.find_by_employee_id_and_payroll_category_id(@employee, c) -%>