app/views/employees/_position.html.erb

SELECT "employee_categories".* FROM "employee_categories"
---
			<td><%= c.label :Employee_Category%></td>
			<td><%= c.select :employee_category_id, EmployeeCategory.all.collect {|e| [e.name,e.id]},{prompt:true},:style =>"width: 175px"%>