app/views/employees/_select_department.html.erb


      <%= f.select :id, EmployeeDepartment.all.collect {|b| [b.name,b.id]},{prompt:"Select Department"},{onchange:"$('#user_form2').submit();",class: "form-control",style:"width:300px"} %>
---
SELECT "employee_departments".* FROM "employee_departments"