app/views/employees/department_payslip.html.erb

SELECT "employee_departments".* FROM "employee_departments"
---
	    <b>Select a Deparyment:</b>
		    <%= f.select :id, EmployeeDepartment.all.collect {|b| [b.name,b.id]},{prompt:"Select a Department"},{onchange:"$('#user_form2').submit();",class:"form-control",style: "width:250px"}%>