app/views/employees/search_employee.html.erb

SELECT "employee_departments".* FROM "employee_departments"
SELECT "employee_categories".* FROM "employee_categories"
SELECT "employee_positions".* FROM "employee_positions"
SELECT "employee_grades".* FROM "employee_grades"
---
 	 <tr>
         <td class="col-3"><%= f.select :employee_department_id, EmployeeDepartment.all.collect {|b| [b.name,b.id]},{prompt:"select department"},{onchange:"$('#user_form').submit();", class: 'form-control'}%></td>

         <td class="col-3"><%= f.select :employee_category_id, EmployeeCategory.all.collect {|b| [b.name,b.id]},{prompt:"Select Category"},{onchange:"$('#user_form').submit();", class: 'form-control'}%></td>

         <td class="col-3"><%= f.select :employee_position_id,EmployeePosition.all.collect {|b| [b.name,b.id]},{prompt:"Select Position"},{onchange:"$('#user_form').submit();", class: 'form-control'}%></td>

         <td class="col-3"><%= f.select :employee_grade_id, EmployeeGrade.all.collect {|b| [b.name,b.id]},{prompt:"Select Grade"},{onchange:"$('#user_form').submit();", class: 'form-control'}%></td>