app/views/employees/subject_assignment.html.erb

   <%= form_for :subject_assignment, url:{action:'assign_subject'}, method: :get,remote:true,html:{id: "user_form"} do |f|%>
      <%= f.select :id, @batches.collect {|b| [b.course.course_name+" "+b.course.section_name+" - "+b.name,b.id]},{prompt:"Select Course"},{onchange:"$('#user_form').submit();",class: "form-control",style:"width:350px"} %>
---
SELECT "courses".* FROM "courses"  WHERE "courses"."id" IN (2)