app/views/employees/view_employee_payslip.html.erb


    <%@emp=Employee.find(@payslip.employee_id)%>
    <%approved=MonthlyPayslip.where(employee_id:@emp.id,is_approved:true).pluck(:is_approved)%>
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 9]]
SELECT "monthly_payslips"."is_approved" FROM "monthly_payslips"  WHERE "monthly_payslips"."employee_id" = 9 AND "monthly_payslips"."is_approved" = 'true'


        		<%is_deduction=PayrollCategory.where(is_deduction:false)%>
        	<%is_deduction.each do |c| %>
      <% val = EmployeeSaleryStructure.where(employee_id:@emp.id,payroll_category_id: c.id).pluck(:amount) %>
---
SELECT "payroll_categories".* FROM "payroll_categories"  WHERE "payroll_categories"."is_deduction" = 'false'
SELECT "employee_salery_structures"."amount" FROM "employee_salery_structures"  WHERE "employee_salery_structures"."employee_id" = 9 AND "employee_salery_structures"."payroll_category_id" = 16