app/views/students/admission1.html.erb


      <%=f.select :batch_id, Batch.all.collect {|b| [b.course.course_name+" "+b.course.section_name+" - "+b.name,b.id]}, {prompt:true}, {class: "form-control"}%>
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "batches".* FROM "batches"

       <%= t('Nationality')%><span class="necessary-field">*</span>
        <%=f.select :nationality_id,Country.all.collect{|c| [c.name,c.id]},{prompt:true},{class: "form-control"}%>
---
SELECT "countries".* FROM "countries"


      <%=f.select :category_id, Category.all.collect{|c| [c.name,c.id]},{prompt:true},{class: "form-control"}%>
---
SELECT "categories".* FROM "categories"