app/views/students/admission2.html.erb

SELECT "countries".* FROM "countries"
---
       <%= t('Country')%>
         <%=f.select :country_id, Country.all.collect{|c| [c.name, c.id]},{prompt:true},{class: "form-control"}%>