app/views/exam_setting/new.html.erb

SELECT "courses".* FROM "courses"
---

      <%= f.select :id, @courses.collect {|b| [b.course_name,b.id]}, {prompt:"Select Course"},{onchange:"$('#class_form').submit();",class: "form-control",style:"width:350px"} %>