app/views/exam_setting/newrank.html.erb


       <%= f.select :id, @courses.collect {|b| [b.course_name,b.id]}, {prompt:"Select Course"},{onchange:"$('#class_form').submit();",class: "form-control",style:"width:350px"} %>
---
SELECT "courses".* FROM "courses"