Educational-ERP/app/views/batches/index.html.erb

SELECT `courses`.* FROM `courses`
---
		<%= f.label :select_course%>
		<%= f.select :id, @courses.collect {|c| [c.course_name,c.id]},
              {prompt:true},{onchange:"$('#course_form').submit();"}%>