app/views/batch_transfers/_batch_transfer.html.erb

        <tbody>
        <% @course.batches.each do |batch| %>
---
SELECT "batches".* FROM "batches"  WHERE "batches"."course_id" = $1  [["course_id", 2]]