app/views/batch_transfers/index.html.erb


	<%= f.select :id,Course.all.collect{|p| [p.course_name,p.id]},
         {prompt:true},{onchange:"$('#transfer').submit();",class: "select2 form-control select2-offscreen"}%>
---
SELECT "courses".* FROM "courses"