app/views/grading_levels/index.html.erb

SELECT "batches".* FROM "batches"
---
<%=form_for ([@batch,@grading_level]) do|f|%>
<%= select("batch1","batch_id",Batch.all.collect{|p| [p.name,p.id]})%>