app/views/weekdays/_weekdays.html.erb

SELECT  "weekdays".* FROM "weekdays"  WHERE "weekdays"."batch_id" = 2 AND "weekdays"."weekday" = 'Sunday' LIMIT 1
---
        <td><%= @day[q] %></td>
<% @weekday= Weekday.find_by_batch_id_and_weekday(@batch.id,@day[q])%>