app/views/weekdays/index.html.erb

   <%= form_for :batch, url:{action:'select'},method: :get,remote:true,html:{id: "batch_form"} do |f| %>
    <%= f.select :id, Batch.all.collect {|b| [b.course.course_name+" "+b.course.section_name+" - "+b.name, b.id]},{prompt:'Select a batch'},{onchange:"$('#batch_form').submit();",class: "form-control",style:"width:350px"} %>
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "batches".* FROM "batches"