app/views/calender/_month.html.erb


                  <% @event=Event.find_by_start_date(current_date)%>
---
SELECT "events".* FROM "events"  WHERE (start_date<='2014-12-02' AND end_date>='2014-12-02')