app/views/exam_groups/index.html.erb


  <%= f.select :id, Course.all.collect {|b| [b.course_name+" "+b.section_name,b.id]}, {prompt:true},{onchange:"$('#exam_form').submit();",class: "form-control",style: "width:300px"}%>
---
SELECT "courses".* FROM "courses"