app/views/batches/index.html.erb

				<!-- </div> -->
		<%= f.select :id, @courses.collect {|c| [c.course_name+" "+c.section_name,c.id]},prompt:true%>
---
SELECT "courses".* FROM "courses"