app/controllers/attendences_controller.rb

SELECT "batches".* FROM "batches"
---
  def attendence_register
    @batches = Batch.all

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]
---
  def select_subject
    @batch = Batch.find(params[:batch][:id])
    @subjects = @batch.subjects.all

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 6 AND "time_table_entries"."batch_id" = 2
---
  def select
    @subject = Subject.find(params[:subject][:id])
    @batch = @subject.batch
    @students = @batch.students.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @batch.id)

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 2 AND "time_table_entries"."batch_id" = 2
---
  def display
    @subject = Subject.find(params[:subject_id])
    @batch = @subject.batch
    @students = @batch.students.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @batch.id)

SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 6]]
---
  def new_attendence
    @attendence = Attendence.new
    @student = Student.find(params[:student_id])

INSERT INTO "attendences" ("batch_id", "created_at", "month_date", "reason", "student_id", "time_table_entry_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 1 AND "time_table_entries"."batch_id" = 2
---
  def create
    @today = params[:attendence][:month_date].to_date
    @attendence = Attendence.new(attendence_params)
    @attendence.save

    @subject = Subject.find(params[:subject_id])
    @batch = @attendence.batch
    @students = @batch.students.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @batch.id)

SELECT  "attendences".* FROM "attendences"  WHERE "attendences"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 6]]
---
  def edit_attendence
    @attendence = Attendence.find(params[:id])
    @student = Student.find(@attendence.student_id)

SELECT  "attendences".* FROM "attendences"  WHERE "attendences"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "attendences" SET "reason" = $1, "updated_at" = $2 WHERE "attendences"."id" = 5  [["reason", "oiuytr"], ["updated_at", "2014-12-12 11:10:05.195556"]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 1 AND "time_table_entries"."batch_id" = 2
---
  def update_attendence
    @attendence = Attendence.find(params[:id])
    @attendence.update(attendence_params)
    @today = params[:date].to_date
    @subject = Subject.find(params[:subject_id])
    @batch = @attendence.batch
    @students = @batch.students.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @batch.id)

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "attendences".* FROM "attendences"  WHERE "attendences"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "attendences" WHERE "attendences"."id" = $1  [["id", 6]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 1 AND "time_table_entries"."batch_id" = 2
---
  def delete_attendence
    @today = params[:date].to_date
    @subject = Subject.find(params[:subject_id])
    @batch = Batch.find(params[:batch])

    @attendence = Attendence.find(params[:id])
    @attendence.destroy

    @students = @batch.students.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @batch.id)

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]
---
  def select_batch
    @batch = Batch.find(params[:batch][:id])
    @subjects = @batch.subjects.all

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "batch_events".* FROM "batch_events"  WHERE "batch_events"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 1 AND "time_table_entries"."batch_id" = 2
---
  def generate_report
    @subject = Subject.find(params[:report][:subject_id])
    @start_date = params[:report][:start_date]
    @end_date = params[:report][:end_date]
    @students = @subject.batch.students.all
    @batch_events = @subject.batch.batch_events.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @subject.batch.id)

SELECT  "general_settings".* FROM "general_settings"   ORDER BY "general_settings"."id" ASC LIMIT 1
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 2]]
SELECT "batch_events".* FROM "batch_events"  WHERE "batch_events"."batch_id" = $1  [["batch_id", 2]]
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 1 AND "time_table_entries"."batch_id" = 2
---
  def attendence_report
    @general_setting = GeneralSetting.first
    @subject = Subject.find(params[:subject_id])
    @start_date = params[:start_date]
    @end_date = params[:end_date]
    @batch = @subject.batch
    @students = @batch.students.all
    @batch_events = @batch.batch_events.all
    @time_table_entries = TimeTableEntry.where(subject_id: @subject.id, batch_id: @batch.id)