app/controllers/batches_controller.rb

  def index
    @courses = Course.all
---
SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1