app/controllers/batch_transfers_controller.rb

  def select
    @course = Course.find(params[:batch_transfer][:id])
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def transfer
    @batch = Batch.find(params[:id])
    @batchs = Batch.all
    @students = @batch.students.all
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "batches".* FROM "batches"
SELECT "students".* FROM "students"  WHERE "students"."batch_id" = $1  [["batch_id", 3]]

  def student_transfer
    @batch = Batch.find(params[:transfer][:batch_id])
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 3]]