app/controllers/calender_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
  def event_view
    @event = Event.find(params[:event_id])