app/controllers/categories_controller.rb

  def index
    @category = Category.new
    @categorys = Category.all
---
SELECT `categories`.* FROM `categories`