app/controllers/class_timings_controller.rb

  def index
    @batches = Batch.includes(:course).all
---
SELECT "batches".* FROM "batches"

  def new
    @batch = Batch.find(params[:batch_id])
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @batch = Batch.find(params[:batch_id])
    @class_timings = @batch.class_timings.all
    @class_timing1 = @batch.class_timings.new(params_class)
      if @class_timing1.save
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1  ORDER BY start_time ASC  [["batch_id", 2]]
INSERT INTO "class_timings" ("batch_id", "created_at", "end_time", "is_break", "name", "start_time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    authorize! :destroy, @class_timing1
    @batch = Batch.find(params[:batch_id])
    @class_timings = @batch.class_timings.all
    @class_timing1 = @batch.class_timings.find(params[:id])
    if @class_timing1.destroy
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."id" = $2 LIMIT 1  [["batch_id", 2], ["id", 4]]
DELETE FROM "class_timings" WHERE "class_timings"."id" = $1  [["id", 4]]

  def edit
    @batch = Batch.find(params[:batch_id])
    @class_timing1 = @batch.class_timings.find(params[:id])
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."id" = $2 LIMIT 1  [["batch_id", 2], ["id", 1]]

  def update
    @batch = Batch.find(params[:batch_id])
    @class_timings = @batch.class_timings.all
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."id" = $2 LIMIT 1  [["batch_id", 2], ["id", 1]]

  def select
    @batch = Batch.find(params[:batch][:id])
    @class_timings = @batch.class_timings.all
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1  ORDER BY start_time ASC  [["batch_id", 3]]