app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1
---
  def index

    @courses=Course.all

INSERT INTO `courses` (`code`, `course_name`, `created_at`, `section_name`, `updated_at`) VALUES ('123', 'computer', '2014-09-02 11:46:09', 'sem 1', '2014-09-02 11:46:09')
---
  def create
    @course=Course.new(postparam)

    if  @course.save

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "batches".* FROM "batches"  WHERE "batches"."course_id" = $1 AND "batches"."course_id" = 2 LIMIT 1  [["course_id", 2]]
---
  def show
  	@course=Course.find(params[:id])


    @batch=@course.batches.find_by_course_id(params[:id])