app/controllers/employees_controller.rb

  def department_payslip
        @salary_dates = MonthlyPayslip.all
---
SELECT "monthly_payslips".* FROM "monthly_payslips"