app/controllers/employees_controller.rb

SELECT "batches".* FROM "batches"
SELECT "courses".* FROM "courses"  WHERE "courses"."id" IN (2)
---
  def subject_assignment
    @batches = Batch.includes(:course).all