app/controllers/employees_controller.rb

SELECT "employee_positions".* FROM "employee_positions"  WHERE "employee_positions"."status" = 't'  ORDER BY "employee_positions"."name" ASC
---
  def new_position
    @employee_position_new = EmployeePosition.new
    @positions1 = EmployeePosition.where(status: true).order(:name)

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
  def search
    @employee = Employee.find(params[:format])

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update_reporting_manager_name
    @employee = Employee.find(params[:id])

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "employees" SET "reporting_manager_id" = $1, "updated_at" = $2 WHERE "employees"."id" = 1  [["reporting_manager_id", 1], ["updated_at", "2014-12-12 12:35:07.069360"]]
---
  def update_reporting_manager
    @employee = Employee.find(params[:id])
    @employee.update(employee_params)

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
  def change_reporting_manager
    @employee = Employee.find(params[:format])

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
  def profile
    @employee = Employee.find(params[:format])

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]
---
  def assign_subject
    @batch = Batch.find(params[:subject_assignment][:id])
    @subject = @batch.subjects.all

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 4]]
---
  def assign_subject_disp
    @subject = Subject.find(params[:subject_assignment][:subject_id])

SELECT  "employee_departments".* FROM "employee_departments"  WHERE "employee_departments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees"  WHERE "employees"."employee_department_id" = $1  [["employee_department_id", 1]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "employee_subjects".* FROM "employee_subjects"  WHERE "employee_subjects"."employee_id" = 1 AND "employee_subjects"."subject_id" = 4 LIMIT 1
---
  def list_emp
    @department = EmployeeDepartment.find(params[:subject_assignment][:id])
    @employees = @department.employees.all
    @subject = Subject.find(params[:format])
    @assigned_employees = EmployeeSubject.where(subject_id: @subject.id)

SELECT  "employee_departments".* FROM "employee_departments"  WHERE "employee_departments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees"  WHERE "employees"."employee_department_id" = $1  [["employee_department_id", 1]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "employee_subjects" ("created_at", "employee_id", "subject_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-12 10:15:10.639682"], ["employee_id", 1], ["subject_id", 4], ["updated_at", "2014-12-12 10:15:10.639682"]]
SELECT  "employee_subjects".* FROM "employee_subjects"  WHERE "employee_subjects"."employee_id" = 1 AND "employee_subjects"."subject_id" = 4 LIMIT 1
---
  def assign_employee
    @department = EmployeeDepartment.find(params[:department_id])
    @employee = Employee.find(params[:id])
    @employees = @department.employees.all
    @subject = Subject.find(params[:format])
    @assigned_employee = EmployeeSubject.create(employee_id: @employee.id, subject_id: @subject.id)
    @assigned_employees = EmployeeSubject.where(subject_id: @subject.id)

SELECT  "employee_departments".* FROM "employee_departments"  WHERE "employee_departments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees"  WHERE "employees"."employee_department_id" = $1  [["employee_department_id", 1]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "employee_subjects".* FROM "employee_subjects"  WHERE "employee_subjects"."employee_id" = 1 AND "employee_subjects"."subject_id" = 4 LIMIT 1
DELETE FROM "employee_subjects" WHERE "employee_subjects"."id" = $1  [["id", 1]]
---
  def remove_employee
    @department = EmployeeDepartment.find(params[:department_id])
    @employee = Employee.find(params[:id])
    @employees = @department.employees.all
    @subject = Subject.find(params[:format])
    @assigned_employee = EmployeeSubject.where(employee_id: @employee.id, subject_id: @subject.id)
    @assigned_employee.destroy_all(employee_id: @employee.id, subject_id: @subject.id)

SELECT "employee_departments".* FROM "employee_departments"
---
  def search_employee
    @department = EmployeeDepartment.all

SELECT "employees".* FROM "employees"  WHERE (first_name LIKE 'X%')
---
  def search_emp
    unless params[:search].empty?
      other_conditions = ''

      other_conditions += " AND employee_department_id = '#{params[:advance_search][:employee_department_id]}'" unless params[:advance_search][:employee_department_id] == ''
      other_conditions += " AND employee_category_id = '#{params[:advance_search][:employee_category_id]}'" unless params[:advance_search][:employee_category_id] == ''
      other_conditions += " AND employee_position_id = '#{params[:advance_search][:employee_position_id]}'" unless params[:advance_search][:employee_position_id] == ''
      other_conditions += " AND employee_grade_id = '#{params[:advance_search][:employee_grade_id]}'" unless params[:advance_search][:employee_grade_id] == ''

      @employee = Employee.where('first_name LIKE ?' + other_conditions, "#{params[:search]}%")

SELECT "employee_departments".* FROM "employee_departments"
---
  def select_employee_department
    @department = EmployeeDepartment.all

SELECT  "employee_departments".* FROM "employee_departments"  WHERE "employee_departments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees"  WHERE "employees"."employee_department_id" = $1  [["employee_department_id", 1]]
---
  def department_employee_list
    @department = EmployeeDepartment.find(params[:select_department][:id])
    @employees = @department.employees.all

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 9]]
SELECT "payroll_categories".* FROM "payroll_categories"
---
  def monthly_payslip
    @employee = Employee.find(params[:format])
    @independent_categories = PayrollCategory.all

SELECT "employees"."id" FROM "employees"
SELECT "monthly_payslips"."employee_id" FROM "monthly_payslips"
SELECT "employee_salery_structures"."amount" FROM "employee_salery_structures"  WHERE "employee_salery_structures"."employee_id" IS NULL
SELECT "payroll_categories".* FROM "payroll_categories"  WHERE "payroll_categories"."is_deduction" = 'true'
SELECT "employee_salery_structures"."amount" FROM "employee_salery_structures"  WHERE "employee_salery_structures"."employee_id" = 20 AND "employee_salery_structures"."payroll_category_id" = 19
INSERT INTO "monthly_payslips" ("amount", "created_at", "employee_id", "salary_date", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 0], ["created_at", "2014-11-10 11:10:53.253359"], ["employee_id", 20], ["salary_date", "2014-11-10"], ["updated_at", "2014-11-10 11:10:53.253359"]]
---
  def one_click_payslip_generate
    salary_date = params[:payslip][:joining_date].to_date
    @employees = Employee.all
    already_created = MonthlyPayslip.all.pluck(:employee_id)
    @employees.each do |emp|
      if already_created.include? emp.id

      else
            counter = 0
            tot = 0
            tot_deduction = 0
            grand_tot = 0
            amount = EmployeeSaleryStructure.where(employee_id: emp[counter]).pluck(:amount)
            amount.each do |i|
              tot += i.to_f
            end

            is_deduction = PayrollCategory.where(is_deduction: 'true')
            is_deduction.each do |i|
              amount = EmployeeSaleryStructure.where(employee_id: emp.id, payroll_category_id: i).pluck(:amount)
              amount.each do   |i|
                tot_deduction += i.  to_f
              end

            end
            grand_tot = tot - tot_deduction
            MonthlyPayslip.create(employee_id: emp.id, amount: grand_tot, is_approved: false, salary_date: salary_date)

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 16]]
SELECT  "monthly_payslips".* FROM "monthly_payslips"  WHERE "monthly_payslips"."employee_id" = $1 AND ("monthly_payslips"."salary_date" BETWEEN '2014-11-01' AND '2014-12-01') LIMIT 1  [["employee_id", 16]]
SELECT "payroll_categories".* FROM "payroll_categories"  WHERE "payroll_categories"."is_deduction" = 'true'
SELECT "employee_salery_structures"."amount" FROM "employee_salery_structures"  WHERE "employee_salery_structures"."employee_id" = 16 AND "employee_salery_structures"."payroll_category_id" = 19
---
  def create_monthly_payslip
    @employee = Employee.find(params[:format])
    @salary_date = Date.parse(params[:salery_slip][:salery_date])
    unless @salary_date.to_date < @employee.joining_date.to_date
      start_date = @salary_date - ((@salary_date.day - 1).days)
      end_date = start_date + 1.month

      payslip_exists = @employee.monthly_payslips.where(salary_date: start_date..end_date).take
      total_salary = 0
      tot_deduction = 0
      amount = []
      is_deduction = PayrollCategory.where(is_deduction: 'true')
      is_deduction.each do |i|
        amount = EmployeeSaleryStructure.where(employee_id: @employee.id, payroll_category_id: i).pluck(:amount)

INSERT INTO "monthly_payslips" ("amount", "created_at", "employee_id", "salary_date", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 44912.7], ["created_at", "2014-11-10 09:13:39.815068"], ["employee_id", 16], ["salary_date", "2014-11-10"], ["updated_at", "2014-11-10 09:13:39.815068"]]
---
          flash[:notice] = 'Payslip of ' + @employee.first_name + ' is already generated'
      end
      else
        MonthlyPayslip.create(salary_date: @salary_date, employee_id: params[:format], amount: total_salary)

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 16]]
SELECT "payroll_categories".* FROM "payroll_categories"  WHERE "payroll_categories"."payroll_category_id" = 16
SELECT  "employee_salery_structures".* FROM "employee_salery_structures"  WHERE "employee_salery_structures"."employee_id" = 16 AND "employee_salery_structures"."payroll_category_id" = 16 LIMIT 1
INSERT INTO "employee_salery_structures" ("amount", "created_at", "employee_id", "payroll_category_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "35645"], ["created_at", "2014-11-10 09:13:36.980879"], ["employee_id", 16], ["payroll_category_id", 16], ["updated_at", "2014-11-10 09:13:36.980879"]]
---
  def employee_structure
    @employee = Employee.find(params[:employee_id])
    @independent_categories = PayrollCategory.all
    @amount = params[:amount]
    @payroll_category = params[:id]
    @salary = EmployeeSaleryStructure.where(employee_id: @employee.id, payroll_category_id: @payroll_category).take
    if @salary.nil?
      EmployeeSaleryStructure.create(employee_id: @employee.id, payroll_category_id: @payroll_category, amount: @amount)

SELECT "monthly_payslips".* FROM "monthly_payslips"
---
  def select_month
    @salary_dates = MonthlyPayslip.all

SELECT "monthly_payslips"."salary_date" FROM "monthly_payslips"  WHERE "monthly_payslips"."salary_date" IS NULL
---
  def one_click_payslip_revert
    salary_date = params[:payslip][:joining_date].to_date
    b = MonthlyPayslip.where(salary_date: @salary_date).pluck(:salary_date)

SELECT "monthly_payslips"."salary_date" FROM "monthly_payslips"  WHERE "monthly_payslips"."employee_id" = 1
SELECT  "employee_departments".* FROM "employee_departments"  WHERE "employee_departments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees"  WHERE "employees"."employee_department_id" = $1  [["employee_department_id", 1]]
---
  def view_payslip
    @salary_dates = MonthlyPayslip.all
    @department = EmployeeDepartment.find(params[:format])
    @employees = @department.employees.all

SELECT  "monthly_payslips".* FROM "monthly_payslips"  WHERE "monthly_payslips"."salary_date" IN ('2014-11-08') AND "monthly_payslips"."employee_id" = 22 LIMIT 1
---
  def view_employee_payslip
    @payslip = MonthlyPayslip.find_by_salary_date_and_employee_id(params[:salary_date], params[:employee_id])

SELECT  "monthly_payslips".* FROM "monthly_payslips"  WHERE "monthly_payslips"."id" = $1 LIMIT 1  [["id", 49]]
---
  def employee_individual_payslip_pdf
    @payslip = MonthlyPayslip.find(params[:payslip])