app/controllers/exam_groups_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses ||= Course.all