app/controllers/exam_setting_controller.rb

SELECT "courses".* FROM "courses"
---
    def new
      @courses=Course.all

SELECT "courses".* FROM "courses"
---
    def newrank
      @courses=Course.all

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
---
    def setting
    	@course=Course.find(params[:course_id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
---
    def settingrank
       @course=Course.find(params[:course_id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "class_designations".* FROM "class_designations"  WHERE "class_designations"."course_id" = $1  [["course_id", 2]]
INSERT INTO "class_designations" ("course_id", "created_at", "marks", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["course_id", 2], ["created_at", "2014-12-13 12:57:33.262271"], ["marks", "62.0"], ["name", "First Class"], ["updated_at", "2014-12-13 12:57:33.262271"]]
---
    def create
      @course=Course.find(params[:course_id])
      @class_dess=@course.class_designations.all
      @class_des1=@course.class_designations.new(params_class)
      if @class_des1.save

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1  ORDER BY prioriy ASC  [["course_id", 2]]
SELECT MAX("ranking_levels"."prioriy") AS max_id FROM "ranking_levels"
INSERT INTO "ranking_levels" ("course_id", "created_at", "full_course", "marks", "marks_limit_type", "name", "prioriy", "subject_count", "subject_limit_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def createrank
      @course=Course.find(params[:course_id])

      @rank_levels=@course.ranking_levels.order('prioriy ASC')
      @rank_lev1=@course.ranking_levels.new(params_rank)
      @max_rank=RankingLevel.maximum('prioriy')
      if @max_rank.nil?
        @max_rank=0.to_i
      end
      @rank_lev1.prioriy=@max_rank+1.to_i
      if @rank_lev1.save

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1  ORDER BY prioriy ASC  [["course_id", 2]]
SELECT  "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1 AND "ranking_levels"."id" = $2 LIMIT 1  [["course_id", 2], ["id", 2]]
---
    def increase_priority
         @course=Course.find(params[:course_id])
         @rank_levels=@course.ranking_levels.order('prioriy ASC')
           @rank_lev1=@course.ranking_levels.find(params[:id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1  ORDER BY prioriy ASC  [["course_id", 2]]
SELECT  "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1 AND "ranking_levels"."id" = $2 LIMIT 1  [["course_id", 2], ["id", 1]]
---
    def decrease_priority
        @course=Course.find(params[:course_id])
        @rank_levels=@course.ranking_levels.order('prioriy ASC')
          @rank_lev1=@course.ranking_levels.find(params[:id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "class_designations".* FROM "class_designations"  WHERE "class_designations"."course_id" = $1 AND "class_designations"."id" = $2 LIMIT 1  [["course_id", 2], ["id", 2]]
---
    def edit
        @course=Course.find(params[:course_id])
        @class_des1=@course.class_designations.find(params[:id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "class_designations".* FROM "class_designations"  WHERE "class_designations"."course_id" = $1 AND "class_designations"."id" = $2 LIMIT 1  [["course_id", 2], ["id", 2]]
---
    def update
        @course=Course.find(params[:course_id])
        @class_dess=@course.class_designations.all

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1 AND "ranking_levels"."id" = $2 LIMIT 1  [["course_id", 2], ["id", 1]]
---
    def editRank
        @course=Course.find(params[:course_id])
        @rank_lev1=@course.ranking_levels.find(params[:id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1  ORDER BY prioriy ASC  [["course_id", 2]]
SELECT  "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1 AND "ranking_levels"."id" = $2 LIMIT 1  [["course_id", 2], ["id", 1]]
---
    def updateRank
      @course=Course.find(params[:course_id])
      @rank_levels=@course.ranking_levels.order('prioriy ASC')
      @rank_lev1=@course.ranking_levels.find(params[:id])

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "class_designations".* FROM "class_designations"  WHERE "class_designations"."course_id" = $1  [["course_id", 2]]
---
    def select
        @course=Course.find(params[:course][:id])
        @class_dess=@course.class_designations.all

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "ranking_levels".* FROM "ranking_levels"  WHERE "ranking_levels"."course_id" = $1  ORDER BY prioriy ASC  [["course_id", 2]]
---
    def selectrank
        @course=Course.find(params[:course][:id])
        @rank_levels=@course.ranking_levels.order('prioriy ASC')