app/controllers/exam_groups_controller.rb

  def select
    @course = Course.find(params[:course][:id])
    @batches = @course.batches.all
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "batches".* FROM "batches"  WHERE "batches"."course_id" = $1  [["course_id", 2]]