app/controllers/grading_levels_controller.rb

SELECT  "batches".* FROM "batches"   ORDER BY "batches"."id" ASC LIMIT 1
---
  def index
    @batches = Batch.includes(:course).all

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "grading_levels".* FROM "grading_levels"  WHERE "grading_levels"."batch_id" = $1  [["batch_id", 2]]
---
  def select
    @batch = Batch.find(params[:batch][:id])
    @grading_levels = @batch.grading_levels.all