app/controllers/newscasts_controller.rb

  def select
    unless params[:newscast][:title].empty?
---
SELECT "newscasts".* FROM "newscasts"  WHERE (title like 'S%')
SELECT COUNT(*) FROM "newscasts"  WHERE (title like 'S%')

  def show
    @newscast = Newscast.find(params[:id])
---
SELECT  "newscasts".* FROM "newscasts"  WHERE "newscasts"."id" = $1 LIMIT 1  [["id", 2]]