app/controllers/students_controller.rb

  def admission1
    @student = Student.new
    # @batches = Batch.includes(:course).all
    @date = Date.today.strftime('%Y%m%d')
    if Student.first.nil?
      @student.admission_no = 'S' + @date.to_s + '1'
    else
      @id = Student.last.id.next
      @student.admission_no = 'S' + @date.to_s + @id.to_s
    end
    @batches = Batch.all.includes(:course)
---
SELECT  "students".* FROM "students"   ORDER BY "students"."id" DESC LIMIT 1
SELECT "batches".* FROM "batches"

  def create
    @student = Student.new(student_params)
    @batches = Batch.all.includes(:course)
    if @student.save
---
SELECT "batches".* FROM "batches"
INSERT INTO "students" ("address_line1", "address_line2", "admission_date", "admission_no", "batch_id", "birth_place", "blood_group", "category_id", "city", "country_id", "created_at", "date_of_birth", "email", "first_name", "gender", "language", "last_name", "middle_name", "nationality_id", "phone1", "phone2", "pin_code", "religion", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"

  def admission2
    @student = Student.find(params[:format])
---
SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 5]]

  def search_ajax
    unless params[:search].empty?
      if params[:student][:status].eql? 'present'
        @students = Student.where("concat_ws(' ',first_name,last_name)like '#{params[:search]}%'
        OR concat_ws(' ',last_name,first_name)like '#{params[:search]}%' OR admission_no like '#{params[:search]}%'")
      end
      if params[:student][:status].eql? 'former'
        @students = ArchivedStudent.where("concat_ws(' ',first_name,last_name)like '#{params[:search]}%'
        OR concat_ws(' ',last_name,first_name)like '#{params[:search]}%' OR admission_no like '#{params[:search]}%'")
---
SELECT "students".* FROM "students"  WHERE (concat_ws(' ',first_name,last_name)like 'S%'
SELECT "archived_students".* FROM "archived_students"  WHERE (concat_ws(' ',first_name,last_name)like 'S%'

  def view_all
    @batches = Batch.includes(:course).all
---
SELECT  "batches".* FROM "batches"   ORDER BY "batches"."id" ASC LIMIT 1

  def select
    @batch = Batch.find(params[:batch][:id])
    @students = @batch.students.all
---
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "students".* FROM "students"  WHERE "students"."batch_id" = $1  ORDER BY "students"."id" ASC LIMIT 1  [["batch_id", 2]]

  def profile
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 5]]

  def archived_profile
    @student = ArchivedStudent.find(params[:id])
    @immediate_contact = Guardian.find(@student.immediate_contact)
    @student_previous_data = StudentPreviousData.find_by_student_id(@student.student_id)
    @student_previous_subject_marks = StudentPreviousSubjectMark.where(student_id: @student.student_id)
---
SELECT  "archived_students".* FROM "archived_students"  WHERE "archived_students"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "guardians".* FROM "guardians"  WHERE "guardians"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "student_previous_data".* FROM "student_previous_data"  WHERE "student_previous_data"."student_id" = 3 LIMIT 1
SELECT "student_previous_subject_marks".* FROM "student_previous_subject_marks"  WHERE "student_previous_subject_marks"."student_id" = 4