app/controllers/time_tables_controller.rb

  def new
    @timetables = TimeTable.all
---
SELECT  "time_tables".* FROM "time_tables"   ORDER BY "time_tables"."id" ASC LIMIT 1

  def selectTime
    @time = TimeTableEntry.where(time_table_id: params[:time][:id])
    @time1 = TimeTable.find(params[:time][:id])
---
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."time_table_id" = 1
SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 1]]

  def select
    @time1 = TimeTable.find(params[:t])
    @batch = Batch.find(params[:batch][:id])
    @class_timing = @batch.class_timings.where(is_break: false)
    @subjects = @batch.subjects.all
---
SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."is_break" = 'f'  [["batch_id", 2]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 2]]

  def timetable
    @today = Date.today
    @time_end = TimeTable.all
---
SELECT "time_tables".* FROM "time_tables"  WHERE (time_tables.start_date <= '2014-12-13' AND time_tables.end_date >= '2014-12-13')

  def display_institutional_time_table
    @time_end = TimeTable.all
---
SELECT "time_tables".* FROM "time_tables"  WHERE (time_tables.start_date <= '2014-12-14' AND time_tables.end_date >= '2014-12-14')

  def teacher_time_table_display
    @time = TimeTableEntry.where(time_table_id: params[:time][:id])
    @time_table = TimeTable.find(params[:time][:id])
    @timetable_entries = @time_table.time_table_entries
    @weekdays = @timetable_entries.collect(&:weekday).uniq.sort! { |a, b| a.weekday <=> b.weekday }
    @class_timings = @timetable_entries.collect(&:class_timing).uniq.sort! { |a, b| a.start_time <=> b.start_time }
    @employees = @timetable_entries.collect(&:employee).uniq
---
SELECT "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."time_table_id" = $1  [["time_table_id", 1]]
SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "weekdays".* FROM "weekdays"  WHERE "weekdays"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."employee_id" = 1 AND "time_table_entries"."class_timing_id" = 5 AND "time_table_entries"."weekday_id" = 5 AND "time_table_entries"."time_table_id" = 1 LIMIT 1

  def teachers_timetable
    @timetables = TimeTable.all
---
SELECT  "time_tables".* FROM "time_tables"   ORDER BY "time_tables"."id" ASC LIMIT 1

  def work_allotment
    @employees = Employee.all
    @emp_subs = []
    if request.post?
      params[:employee_subjects]
      @error_obj = EmployeeSubject.allot_work(params[:employee_subjects])
      flash[:notice] = 'Updated work allotment.'
    end
    @batches = Batch.all
    @subjects = @batches.collect(&:subjects).flatten
---
SELECT "employees".* FROM "employees"
SELECT "batches".* FROM "batches"
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]

  def create
    @time_table = TimeTable.new(time_table)
    @error = false
    previous = TimeTable.where('end_date >= ? AND start_date <= ?', @time_table.start_date, @time_table.start_date)
    unless previous.empty?
      @error = true
      @time_table.errors.add(:start_date, 'is within the range of another timetable')
    end
    foreword = TimeTable.where('end_date >= ? AND start_date <= ?', @time_table.end_date, @time_table.end_date)
    unless foreword.empty?
      @error = true
      @time_table.errors.add(:end_date, 'is within the range of another timetable')
    end
    fully_overlapping = TimeTable.where('end_date <= ? AND start_date >= ?', @time_table.end_date, @time_table.start_date)
    unless fully_overlapping.empty?
      @error = true
      @time_table.errors.add(:end_date, 'timetable_in_between_given_dates')
    end
    if @time_table.end_date < @time_table.start_date
      @error = true
      @time_table.errors.add(:end_date, "can't be less than start date")
    end
    unless @error
      if @time_table.save
---
SELECT COUNT(*) FROM "time_tables"  WHERE (end_date >= '2014-12-12' AND start_date <= '2014-12-12')
INSERT INTO "time_tables" ("created_at", "end_date", "start_date", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-12 10:14:24.273987"], ["end_date", "2015-02-12"], ["start_date", "2014-12-12"], ["updated_at", "2014-12-12 10:14:24.273987"]]

  def edit_timetable
    @courses = Batch.all
    @timetables = TimeTable.all
---
SELECT "time_tables".* FROM "time_tables"

  def update_timetable
    @time_table = TimeTable.find(params[:format])
---
SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 1]]

  def time_table_delete
    authorize! :delete, @time
    @time = TimeTable.find(params[:format])
    if @time.destroy
---
SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "time_tables" WHERE "time_tables"."id" = $1  [["id", 2]]

  def update_timetable_values
    @timetable = TimeTable.find(params[:format])

    @error = false
    previous = TimeTable.where('end_date >= ? AND start_date <= ?', @timetable.start_date, @timetable.start_date)

    unless previous.empty?
      @error = true
      @timetable.errors.add(:start_date, 'is within the range of another timetable')
    end

    foreword = TimeTable.where('end_date >= ? AND start_date <= ?', @timetable.end_date, @timetable.end_date)

    unless foreword.empty?
      @error = true
      @timetable.errors.add(:end_date, 'is within the range of another timetable')
    end

    fully_overlapping = TimeTable.where('end_date <= ? AND start_date >= ?', @timetable.end_date, @timetable.start_date)

    unless fully_overlapping.empty?
      @error = true
      @timetable.errors.add(:end_date, 'timetable_in_between_given_dates')
    end

    if @timetable.end_date < @timetable.start_date
      @error = true
      @timetable.errors.add(:end_date, "can't be less than start date")
    end
    if @timetable.update(time_table)
---
SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "time_tables"  WHERE (end_date >= '2014-12-12' AND start_date <= '2014-12-12')
UPDATE "time_tables" SET "end_date" = $1, "updated_at" = $2 WHERE "time_tables"."id" = 1  [["end_date", "2015-03-03"], ["updated_at", "2014-12-12 14:01:25.080525"]]