app/controllers/time_table_entries_controller.rb

SELECT  "time_tables".* FROM "time_tables"  WHERE "time_tables"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "batches".* FROM "batches"
---
  def index
    @time = TimeTable.find(params[:format])
    flash[:notice] = "Time table structure created from #{@time.start_date.strftime('%B %Y')} - #{@time.end_date}"
    @batches = Batch.all

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."is_break" = 'f'  [["batch_id", 2]]
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]
---
  def select
    @time = params[:format]
    @batch = Batch.find(params[:batch][:id])
    @class_timing = @batch.class_timings.where(is_break: false)
    @subjects = @batch.subjects.all

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "employee_subjects".* FROM "employee_subjects"  WHERE "employee_subjects"."subject_id" = 6
---
  def select_subject
    @subject = Subject.find(params[:sub][:subject_id])
    @teachers = EmployeeSubject.where(subject_id: @subject.id)

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "time_table_entries"  WHERE "time_table_entries"."employee_id" = 1 AND "time_table_entries"."weekday_id" = 2 AND "time_table_entries"."time_table_id" = 1
SELECT COUNT(*) FROM "time_table_entries"  WHERE "time_table_entries"."subject_id" = 5 AND "time_table_entries"."time_table_id" = 1
INSERT INTO "time_table_entries" ("batch_id", "class_timing_id", "created_at", "employee_id", "subject_id", "time_table_id", "updated_at", "weekday_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."class_timing_id" = 4 AND "time_table_entries"."weekday_id" = 1 AND "time_table_entries"."time_table_id" = 1 LIMIT 1
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]
SELECT "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."is_break" = 'f'  [["batch_id", 2]]
---
  def assign_time
    @class_timing_id = params[:timing_id]
    @weekday = params[:weekday_id]
    @teacher = params[:teacher]
    @time = params[:time_table_id]
    @subject = Subject.find(params[:subject_id])
    @em = Employee.find(params[:teacher])
    @batch = @subject.batch

    unless TimeTableEntry.where(employee_id: @em.id, weekday_id: @weekday, time_table_id: @time).count >= @em.employee_grade.max_hours_day
      if TimeTableEntry.where(employee_id: @em.id, time_table_id: @time).count < @em.employee_grade.max_hours_week

        if TimeTableEntry.where(subject_id: @subject.id, time_table_id: @time).count >= @subject.max_weekly_classes
          flash[:alert] = 'Warning : Weekly subject limit reached'
        else
          @assign_time = TimeTableEntry.create(batch_id: @batch.id, class_timing_id: @class_timing_id, weekday_id: @weekday, employee_id: @teacher, subject_id: @subject.id, time_table_id: @time)
       end
      else
        flash[:alert] = 'Warning : Max hours per week exceeded'
     end
    else
      flash[:alert] = 'Warning : Max hours per day exceeded'
     end

    @time = params[:time_table_id]
    @subjects = @batch.subjects.all
    @class_timing = @batch.class_timings.where(is_break: false)

SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "time_table_entries" WHERE "time_table_entries"."id" = $1  [["id", 1]]
SELECT "class_timings".* FROM "class_timings"  WHERE "class_timings"."batch_id" = $1 AND "class_timings"."is_break" = 'f'  [["batch_id", 2]]
SELECT "subjects".* FROM "subjects"  WHERE "subjects"."batch_id" = $1  [["batch_id", 2]]
---
  def delete_time
    authorize! :delete, @delete_time
    @delete_time = TimeTableEntry.find(params[:format])
    @delete_time.destroy
    @batch = @delete_time.batch
    @class_timing = @batch.class_timings.where(is_break: false)
    @subjects = @batch.subjects.all