app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "archived_students".* FROM "archived_students"  WHERE "archived_students"."student_id" = 6 LIMIT 1
SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find(params[:id])
    if @user.role.eql? 'Student'
      @student = ArchivedStudent.find_by_student_id(@user.student_id)
      if @student.nil?
        @student = Student.find(@user.student_id)
      end
    end
    if @user.role.eql? 'Employee'
      @employee = Employee.find(@user.employee_id)

SELECT "users".* FROM "users"  WHERE (concat_ws(' ',first_name,last_name)like 's%'
---
  def search
    unless params[:search].empty?
      @users = User.where("concat_ws(' ',first_name,last_name)like '#{params[:search]}%'
        OR concat_ws(' ',last_name,first_name)like '#{params[:search]}%'
        OR username like '#{params[:search]}%'")

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
  def change_password
    @user = User.find(params[:id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = 2  [["encrypted_password", "$2a$10$MJmb/o4bwLt0oU..NBpVEOaiawtTxsNReWMEF1wVf7VGpdYZ5Qlva"], ["updated_at", "2014-12-13 10:38:59.053834"]]
---
  def update_password
    @user = User.find(params[:id])
    if User.authenticate?(@user.username, params[:user][:old_password])
      if params[:user][:new_password].length >= 6 && params[:user][:new_password].length <= 20
        if params[:user][:new_password] == params[:user][:confirm_password]
          @user.password = params[:user][:new_password]
          if @user.update(user_params)

SELECT "users".* FROM "users"  WHERE (role Like 'Admin')
---
  def select
    @users = User.where("role Like '#{params[:user][:role]}'")