app/controllers/weekdays_controller.rb

SELECT "batches".* FROM "batches"
---
  def index
    @weekday = Weekday.new
    @day = %w(Sunday Monday Tuesday Wednesday Thursday Friday Saturday)
    @days = %w(0 1 2 3 4 5 6)
    authorize! :create, @weekday

    @weekdays = Batch.includes(:course).all

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "weekdays".* FROM "weekdays"  WHERE "weekdays"."batch_id" = 2 AND "weekdays"."weekday" = 'Sunday' LIMIT 1
INSERT INTO "weekdays" ("batch_id", "created_at", "updated_at", "weekday") VALUES ($1, $2, $3, $4) RETURNING "id"  [["batch_id", 2], ["created_at", "2014-12-12 10:12:03.224139"], ["updated_at", "2014-12-12 10:12:03.224139"], ["weekday", "Sunday"]]
---
  def create
    @day = %w(Sunday Monday Tuesday Wednesday Thursday Friday Saturday)
    @days = %w(0 1 2 3 4 5 6)

    @batch = params[:weekday][:batch_id]

    @batch = @batch = Batch.find(params[:weekday][:batch_id])
    week = []
    week = params[:weekdays]

    @weekdays = Weekday.where(batch_id: @batch.id)
    unless @weekdays.nil?
      @weekdays.destroy_all
    end
    week.each  do |w|
      divas = @day[w.to_i]
      weekday = Weekday.new(batch_id: @batch.id, weekday: divas)
      weekday.save

SELECT  "batches".* FROM "batches"  WHERE "batches"."id" = $1 LIMIT 1  [["id", 2]]
---
  def select
    @day = %w(Sunday Monday Tuesday Wednesday Thursday Friday Saturday)
    @days = %w(0 1 2 3 4 5 6)
    @batch = Batch.find(params[:batch][:id])