app/views/attendences/_attendence_report.html.erb

					<% total_days+=1 %>
			    <% @attendence=Attendence.find_by_student_id_and_time_table_entry_id_and_month_date(student.id,d.id,date.to_date) %>
---
SELECT  "attendences".* FROM "attendences"  WHERE "attendences"."student_id" = 6 AND "attendences"."time_table_entry_id" = 3 AND "attendences"."month_date" = '2014-11-07' LIMIT 1