app/views/attendences/_attendence.html.erb

SELECT  "student_subjects".* FROM "student_subjects"  WHERE "student_subjects"."student_id" = 6 AND "student_subjects"."subject_id" = 5 LIMIT 1
---
      <%unless @subject.elective_group.nil?%>
        <% is_student_elective = StudentSubject.find_by_student_id_and_subject_id(student.id,@subject.id) %>

SELECT  "attendences".* FROM "attendences"  WHERE "attendences"."student_id" = 5 AND "attendences"."month_date" = '2014-12-02' LIMIT 1
---
           <%@time_table_entries.each do |d|%>
         <% @absent = Attendence.find_by_student_id_and_month_date(student.id,date) %>