app/views/attendences/report.html.erb


      <%= f.select :id, Batch.all.collect {|b| [b.course.course_name+" "+b.course.section_name+" - "+b.name,b.id]},{prompt:true},{onchange:"$('#form_batch').submit();",class:"form-control",style: "width: 300px"}%>
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "batches".* FROM "batches"