app/views/time_table_entries/_display.html.erb

SELECT "weekdays".* FROM "weekdays"  WHERE "weekdays"."batch_id" = $1  [["batch_id", 2]]
---

<% @batch.weekdays.each do |w|%>

SELECT  "time_table_entries".* FROM "time_table_entries"  WHERE "time_table_entries"."class_timing_id" = 4 AND "time_table_entries"."weekday_id" = 1 AND "time_table_entries"."time_table_id" = 1 LIMIT 1
---
        <% @class_timing.each do |c|%>
         <% @present=TimeTableEntry.find_by_class_timing_id_and_weekday_id_and_time_table_id(c.id,w.id,@time) %>

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---

       <font color="blue"><b><%= @present.employee.first_name+" "+@present.employee.last_name%></b></font>