app/views/time_table_entries/_employee_list.html.erb

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
   <%=hidden_field_tag :batch_id%>
 <% @teachers.each do |e| unless e.employee.nil?