Educational-ERP/app/controllers/class_timings_controller.rb

SELECT `batches`.* FROM `batches`
---
	def index
		@batches=Batch.all