Educational-ERP/app/controllers/events_controller.rb

INSERT INTO `events` (`created_at`, `description`, `end_date`, `is_holiday`, `start_date`, `title`, `updated_at`) VALUES ('2014-09-02 05:46:59', 'jklblj', '2015-09-03 00:00:00', 1, '2014-09-06 00:00:00', 'kjh', '2014-09-02 05:46:59')
---
def create
   @event=Event.new(params_event)
   @event.save

SELECT  `events`.* FROM `events`  WHERE `events`.`id` = 3 LIMIT 1
SELECT `batches`.* FROM `batches`
---
def show
	@event=Event.find(params[:id])
	@batches=Batch.all