Educational-ERP/app/controllers/time_table_entries_controller.rb

def index
  @batches=Batch.all
---
SELECT `batches`.* FROM `batches`